In [9]:
import pandas as pd
import os

DATA_PATH = f'{os.getcwd()}\\names\\'

In [10]:
def count_top3(years):
    data = []
    for year in years:
        names = pd.read_csv(
            DATA_PATH + 'yob{}.txt'.format(str(year)),
            names=['Name', 'Gender', 'Count'],
            engine='python'
        )
        data.append(names)
    return pd.concat(data)\
        .groupby('Name').sum()\
        .sort_values(by=['Count'], ascending=False).head(3)

In [11]:
count_top3([1880])
count_top3([1900, 1950, 2000])

         Count
Name
James   111795
John    109595
Robert  101381

In [12]:
def count_dynamics(years):
    data = []
    for year in years:
        names = pd.read_csv(
            DATA_PATH + 'yob{}.txt'.format(str(year)),
            names=['Name', 'Gender', 'Count'],
            engine='python'
        )
        names = names.groupby(['Gender']).sum()
        data.append(names)
    return pd.concat(data, axis=1)

In [13]:
count_dynamics([1900, 1950, 2000])

         Count    Count    Count
Gender
F       299810  1713259  1814922
M       150486  1790871  1962744